WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.0.0/Src/main.c
  return ch;
}

void Delay(unsigned int xms)  // xms
{
    unsigned int x,y;
    for(x=xms;x>0;x--)
        for(y=2000;y>0;y--);
}
char * EC20_sendmsg_cmd1[]={
	"AT+CPMS?\r\n",
	"AT+CNMI=1\r\n",
	"AT+CSCA?\r\n",
	"AT+CMGF=1\r\n",
};
void EC20_Transmit(uint8_t* UART4_Tx)
{ 
	 int size=strlen((const char*)UART4_Tx);
   HAL_UART_Transmit(&huart4, (uint8_t*)UART4_Tx,size,50);
}

void EC20_Transmit_Printf(uint8_t* UART4_Tx)
{ 
	 int size=strlen((const char*)UART4_Tx);
	 HAL_UART_Transmit(&huart3, (uint8_t*)UART4_Tx,size,50);
}
void EC20_Receive()
{
	   HAL_UART_Receive(&huart4, (uint8_t*)ReceiveBuff, COUNTOF(ReceiveBuff),50);
		/*打印收到的数据*/
    for(int i=0;i<COUNTOF(ReceiveBuff);i++)
    {
			  if(ReceiveBuff[i]=='O'&&ReceiveBuff[i+1]=='K')
				{  
					printf("OK\r\n");
					break;
				}
				if(ReceiveBuff[i]=='\0'&&ReceiveBuff[i+1]=='\0'&&ReceiveBuff[i+2]=='\0'&&ReceiveBuff[i+3]=='\0')
				{  
					printf("\n****** 	\r\n");
					break;
				}
				if(ReceiveBuff[i]=='0'&&ReceiveBuff[i+1]=='0'&&ReceiveBuff[i+2]=='0'&&ReceiveBuff[i+3]=='0')
				{  
					break;
				}
        printf("%c",ReceiveBuff[i]);
    }
    printf("\r\n"); 
    for(int i=0;i<=(COUNTOF(ReceiveBuff) - 1);i++)
		{
			if(ReceiveBuff[i]==':'&&ReceiveBuff[i-1]=='C'&&ReceiveBuff[i-2]=='O')
			{
				 i++;
				 for(int j=0;i<=(COUNTOF(ReceiveBuff) - 1);i++,j++)
					{
							/* 转换：之后的GPS数据 给GPS_DATA*/
						   if(ReceiveBuff[i]=='\0'&&ReceiveBuff[i+1]=='\0'&&ReceiveBuff[i+2]=='\0'&&ReceiveBuff[i+3]=='\0')
								{  
									printf("\n****** 	\r\n");
									break;
								}
								
						   GPS_DATA_RECEIVE[j]=ReceiveBuff[i];
							 if(ReceiveBuff[i]=='O'&&ReceiveBuff[i+1]=='K')
								{
									 printf("GPS数据\n");   
									break;
								}
								
							 printf("%c",ReceiveBuff[i]);
							 
					}
				}
		}			
		/*清空数据缓存*/
    for(int i = 0; i < COUNTOF(ReceiveBuff); i++) 
    ReceiveBuff[i]=0;
			
}
void EC20_Init()
{
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_SET);
			HAL_Delay(200);	
			
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_RESET);//拉高控制
			HAL_Delay(300);	

			EC20_UART_PROT_INIT();//改变EC20 的串口模式
			HAL_Delay(200);
			
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_SET);//初始化完成
}
#define Kp 40.0f                       // proportional gain governs rate of convergence toaccelerometer/magnetometer
	 //Kp比例增益 决定了加速度计和磁力计的收敛速度
#define Ki 0.02f          // integral gain governs rate of convergenceof gyroscope biases
		//Ki积分增益 决定了陀螺仪偏差的收敛速度
#define halfT 0.004f      // half the sample period  
		//halfT采样周期的一半
#define dt 0.008f		
float B[6]={0.980358187761106,-0.0105514731414606,0.00754899338354401,0.950648704823113,-0.0354995317649016,1.07449478456729};
float magoffsetx=1.31454428611172,magoffsety=-1.21753632395713,magoffsetz=1.6567777185719;
#define gryo_scale   	(4000.0/65536.0*3.14159/180.0)			//弧度秒
#define accel_scale 	(4.0/65536.0)												//G单位
#define mag_scale 	  (9600.0/16384.0/100.0)							//高斯单位
float accoffsetx=-0.0118443148713821,accoffsety=-0.00939616830387326,accoffsetz=-0.0507891438815726;
float accsensx=1.00851297697413,accsensy=0.991366909333871,accsensz=1.00019364448499;

static float q0=1.0f,q1=0.0f,q2=0.0f,q3=0.0f;
static float exInt = 0, eyInt = 0, ezInt = 0; 
static float k10=0.0f,k11=0.0f,k12=0.0f,k13=0.0f;
static float k20=0.0f,k21=0.0f,k22=0.0f,k23=0.0f;
static float k30=0.0f,k31=0.0f,k32=0.0f,k33=0.0f;
static float k40=0.0f,k41=0.0f,k42=0.0f,k43=0.0f;
float invSqrt(float number)
{
	long i;
	float x,y;
	const float f=1.5f;
	
	x=number*0.5f;
	y=number;
	i=*((long*)&y);
	i=0x5f375a86-(i>>1);
	y=*((float *)&i);
	y=y*(f-(x*y*y));
	return y;
}

void AHRSupdate(float gx, float gy, float gz, float ax, float ay, float az, float mx, float my, float mz,float *roll,float *pitch,float *yaw)
{
           float norm;									//用于单位化
           float hx, hy, hz, bx, bz;		//
           float vx, vy, vz, wx, wy, wz; 
           float ex, ey, ez;
//					 float tmp0,tmp1,tmp2,tmp3;
 
           // auxiliary variables to reduce number of repeated operations  辅助变量减少重复操作次数
           float q0q0 = q0*q0;
           float q0q1 = q0*q1;
           float q0q2 = q0*q2;
           float q0q3 = q0*q3;
           float q1q1 = q1*q1;
           float q1q2 = q1*q2;
           float q1q3 = q1*q3;
           float q2q2 = q2*q2;
           float q2q3 = q2*q3;
           float q3q3 = q3*q3;
          
           // normalise the measurements  对加速度计和磁力计数据进行规范化
           norm = invSqrt(ax*ax + ay*ay + az*az);
           ax = ax * norm;
           ay = ay * norm;
           az = az * norm;
           norm = invSqrt(mx*mx + my*my + mz*mz);
           mx = mx * norm;
           my = my * norm;
           mz = mz * norm;
          
           // compute reference direction of magnetic field  计算磁场的参考方向
					 //hx,hy,hz是mx,my,mz在参考坐标系的表示
           hx = 2*mx*(0.50 - q2q2 - q3q3) + 2*my*(q1q2 - q0q3) + 2*mz*(q1q3 + q0q2);
           hy = 2*mx*(q1q2 + q0q3) + 2*my*(0.50 - q1q1 - q3q3) + 2*mz*(q2q3 - q0q1);
           hz = 2*mx*(q1q3 - q0q2) + 2*my*(q2q3 + q0q1) + 2*mz*(0.50 - q1q1 -q2q2);    
						//bx,by,bz是地球磁场在参考坐标系的表示
           bx = sqrt((hx*hx) + (hy*hy));
           bz = hz;
          
// estimated direction of gravity and magnetic field (v and w)  //估计重力和磁场的方向
//vx,vy,vz是重力加速度在物体坐标系的表示
           vx = 2*(q1q3 - q0q2);
           vy = 2*(q0q1 + q2q3);
           vz = q0q0 - q1q1 - q2q2 + q3q3;
					 //wx,wy,wz是地磁场在物体坐标系的表示
           wx = 2*bx*(0.5 - q2q2 - q3q3) + 2*bz*(q1q3 - q0q2);
           wy = 2*bx*(q1q2 - q0q3) + 2*bz*(q0q1 + q2q3);
           wz = 2*bx*(q0q2 + q1q3) + 2*bz*(0.5 - q1q1 - q2q2); 
          
// error is sum ofcross product between reference direction of fields and directionmeasured by sensors 
//ex,ey,ez是加速度计与磁力计测量出的方向与实际重力加速度与地磁场方向的误差，误差用叉积来表示，且加速度计与磁力计的权重是一样的
           ex = (ay*vz - az*vy) + (my*wz - mz*wy);
           ey = (az*vx - ax*vz) + (mz*wx - mx*wz);
           ez = (ax*vy - ay*vx) + (mx*wy - my*wx);

           // integral error scaled integral gain
					 //积分误差
           exInt = exInt + ex*Ki*dt;
           eyInt = eyInt + ey*Ki*dt;
           ezInt = ezInt + ez*Ki*dt;
					// printf("exInt=%0.1f eyInt=%0.1f ezInt=%0.1f ",exInt,eyInt,ezInt);
           // adjusted gyroscope measurements
					 //PI调节陀螺仪数据
           gx = gx + Kp*ex + exInt;
           gy = gy + Kp*ey + eyInt;
           gz = gz + Kp*ez + ezInt;
					 //printf("gx=%0.1f gy=%0.1f gz=%0.1f",gx,gy,gz);
          
