WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.0.0/Src/main.c
           // integrate quaernion rate aafnd normalaizle
					 //欧拉法解微分方程
//           tmp0 = q0 + (-q1*gx - q2*gy - q3*gz)*halfT;
//           tmp1 = q1 + ( q0*gx + q2*gz - q3*gy)*halfT;
//           tmp2 = q2 + ( q0*gy - q1*gz + q3*gx)*halfT;
//           tmp3 = q3 + ( q0*gz + q1*gy - q2*gx)*halfT; 
//					 q0=tmp0;
//					 q1=tmp1;
//					 q2=tmp2;
//					 q3=tmp3;
					 //printf("q0=%0.1f q1=%0.1f q2=%0.1f q3=%0.1f",q0,q1,q2,q3);
////RUNGE_KUTTA 法解微分方程
					  k10=0.5 * (-gx*q1 - gy*q2 - gz*q3);
						k11=0.5 * ( gx*q0 + gz*q2 - gy*q3);
						k12=0.5 * ( gy*q0 - gz*q1 + gx*q3);
						k13=0.5 * ( gz*q0 + gy*q1 - gx*q2);
						
						k20=0.5 * (halfT*(q0+halfT*k10) + (halfT-gx)*(q1+halfT*k11) + (halfT-gy)*(q2+halfT*k12) + (halfT-gz)*(q3+halfT*k13));
						k21=0.5 * ((halfT+gx)*(q0+halfT*k10) + halfT*(q1+halfT*k11) + (halfT+gz)*(q2+halfT*k12) + (halfT-gy)*(q3+halfT*k13));
						k22=0.5 * ((halfT+gy)*(q0+halfT*k10) + (halfT-gz)*(q1+halfT*k11) + halfT*(q2+halfT*k12) + (halfT+gx)*(q3+halfT*k13));
						k23=0.5 * ((halfT+gz)*(q0+halfT*k10) + (halfT+gy)*(q1+halfT*k11) + (halfT-gx)*(q2+halfT*k12) + halfT*(q3+halfT*k13));
						
						k30=0.5 * (halfT*(q0+halfT*k20) + (halfT-gx)*(q1+halfT*k21) + (halfT-gy)*(q2+halfT*k22) + (halfT-gz)*(q3+halfT*k23));
						k31=0.5 * ((halfT+gx)*(q0+halfT*k20) + halfT*(q1+halfT*k21) + (halfT+gz)*(q2+halfT*k22) + (halfT-gy)*(q3+halfT*k23));
						k32=0.5 * ((halfT+gy)*(q0+halfT*k20) + (halfT-gz)*(q1+halfT*k21) + halfT*(q2+halfT*k22) + (halfT+gx)*(q3+halfT*k23));
						k33=0.5 * ((halfT+gz)*(q0+halfT*k20) + (halfT+gy)*(q1+halfT*k21) + (halfT-gx)*(q2+halfT*k22) + halfT*(q3+halfT*k23));
						
						k40=0.5 * (dt*(q0+dt*k30) + (dt-gx)*(q1+dt*k31) + (dt-gy)*(q2+dt*k32) + (dt-gz)*(q3+dt*k33));
						k41=0.5 * ((dt+gx)*(q0+dt*k30) + dt*(q1+dt*k31) + (dt+gz)*(q2+dt*k32) + (dt-gy)*(q3+dt*k33));
						k42=0.5 * ((dt+gy)*(q0+dt*k30) + (dt-gz)*(q1+dt*k31) + dt*(q2+dt*k32) + (dt+gx)*(q3+dt*k33));
						k43=0.5 * ((dt+gz)*(q0+dt*k30) + (dt+gy)*(q1+dt*k31) + (dt-gx)*(q2+dt*k32) + dt*(q3+dt*k33));	
						
						q0=q0 + dt/6.0 * (k10+2*k20+2*k30+k40);
						q1=q1 + dt/6.0 * (k11+2*k21+2*k31+k41);
						q2=q2 + dt/6.0 * (k12+2*k22+2*k32+k42);
						q3=q3 + dt/6.0 * (k13+2*k23+2*k33+k43);
						
           // normalise quaternion
           norm = invSqrt(q0*q0 + q1*q1 + q2*q2 + q3*q3);
           q0 = q0 * norm;
           q1 = q1 * norm;
           q2 = q2 * norm;
           q3 = q3 * norm;
					 
					 *pitch = asin(-2 * q1 * q3 + 2 * q0 * q2)* 57.3;	// pitch
					 *roll  = atan2(2 * q2 * q3 + 2 * q0 * q1, -2 * q1 * q1 - 2 * q2 * q2 + 1)* 57.3;	// roll
					 *yaw   = atan2(2*(q1*q2 + q0*q3),q0*q0+q1*q1-q2*q2-q3*q3) * 57.3;	//yaw
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  //int i=0;
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
 
	uint32_t Uart_count=0;  //Uart_count is used to test uart 
	
	uint8_t Flag_test=SUCCFULL_STA;    //set one
	uint8_t Flag_run =SUCCFULL_STA-1;  //set zero
	
	uint32_t ADC_Value[50];
	uint32_t ad1;
	uint8_t  ADC_i;

	uint8_t UART4_Tx_TEST1[]="AT+CSQ\r\n";
	uint8_t UART4_Tx_TEST2[]="ATD13036699696\r\n";
	uint8_t UART4_Tx_TEST3[]="AT+CPIN?\r\n";
	uint8_t UART4_Tx_TEST4[]="AT+CMGF=1\r\n";
	uint8_t UART4_Tx_TEST5[]="ATI\r\n";
	
	/*电话（可变）*/
	uint8_t UART4_Tx_TEST6[]="AT+CMGS=\"13036699696\"\r\n";
	uint8_t UART4_Tx_TEST7[]="AT+CMEE=2\r\n";
	
	uint8_t UART4_Tx_GPS_TEST0[]="AT\r\n";
	uint8_t UART4_Tx_GPS_TEST1[]="AT+QGPS=1\r\n";
	uint8_t UART4_Tx_GPS_TEST2[]="AT+QGPSLOC?\r\n";
	uint8_t UART4_Tx_GPS_TEST3[]="AT+QGPSCFG=\"gpsnmeatype\",1\r\n";

	/*IP 地址口（可变）*/
  uint8_t UART4_Tx_TCP_TEST1[]="AT+QIOPEN=1,0,\"TCP\",\"119.27.184.248\",1234,0,1\r\n";
	uint8_t UART4_Tx_TCP_TEST2[]="AT+QISEND=0\r\n";
	uint8_t UART4_Tx_TCP_TEST3[]="AT+QICLOSE=0\r\n";
	
  uint8_t UART4_Tx_Flag_end[]={0x1A};
	uint8_t UART4_Tx_CMGS_ER[]="ERROR!!\r\n";
	uint8_t UART4_Tx_CMGS_end[]={0x1A};
	
	uint8_t UART4_Tx_MESSAGE1[]="AT+CPMS?\r\n";
	uint8_t UART4_Tx_MESSAGE2[]="AT+CNMI=1,2,0,1,0\r\n";
	uint8_t UART4_Tx_MESSAGE3[]="AT+CSCA?\r\n";
	uint8_t UART4_Tx_MESSAGE4[]="AT+CMGF=1\r\n";
	
	
	uint8_t UART4_Tx_CMGS[]="HELLO,WORLD!!!CONNECTED SUCUSSFUL!!!\r\n";

	
	uint8_t tempdata[50]={0};
	
	uint8_t Atempdata1[50]={0};
	uint8_t Atempdata2[50]={0};
	uint8_t Atempdata3[50]={0};
	
	uint8_t tempdata1[20]={0};
	uint8_t tempdata2[20]={0};
	uint8_t tempdata3[20]={0};
	uint8_t tempdata4[20]={0};
	uint8_t tempdata5[20]={0};
	uint8_t tempdata6[20]={0};
	uint8_t tempdata7[20]={0};
	
	uint8_t test_count=0;
	uint8_t test_flag=1;
	uint8_t count_ex=100;
	uint8_t count_OK=0;
	uint8_t *pTempdate;
	uint8_t m=0;
	uint8_t test_counter_polling=0;
	
	float pitch,roll,yaw;
	short igx,igy,igz;
	short iax,iay,iaz;
	short imx,imy,imz;
	float gx,gy,gz;
	float ax,ay,az;
	float mx,my,mz;

	float altitude1; //存放初始高度
	pTempdate=tempdata;
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
 	MX_GPIO_Init();
  MX_CRC_Init();
	MX_RTC_Init();
//   MX_DMA_Init();
	MX_UART4_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
  MX_USART3_UART_Init();
  MX_QUADSPI_Init();

  MX_SPI1_Init();
  MX_SPI2_Init();
  MX_ADC1_Init();

  MX_USB_OTG_FS_HCD_Init();

  /* Initialize interrupts */
  MX_NVIC_Init();
  /* USER CODE BEGIN 2 */
	

	/*************init the BMP280****************/
  if (BMP280_Begin() == -1)
  bmp_data.err_cnt++;
	printf("Finshed the inition of BMP280.  \r\n");
	
	/*************init the MPU9250****************/
	Init_MPU9250();
	printf("Finshed the inition of MPU9250.  \r\n");
	
	HAL_GPIO_WritePin(GPIOA,GPIO_PIN_10,GPIO_PIN_SET);//TURN ON LED_RED 
	
	/*************init the EC20****************/	
  //EC20初始化 ,先拉高在拉低
  EC20_Init();
	printf("Finished the inition of EC20\r\n");
	
	printf("Inition Finished\r\n");

	/********init the RTC*******************/
	#if 0
	RTC_HandleTypeDef RtcHandle;
	RTC_TimeTypeDef stimestructureget;
	__HAL_RTC_RESET_HANDLE_STATE(&RtcHandle);
  RtcHandle.Instance = RTC;
  RtcHandle.Init.HourFormat     = RTC_HOURFORMAT_12;
  RtcHandle.Init.AsynchPrediv   = RTC_ASYNCH_PREDIV;
  RtcHandle.Init.SynchPrediv    = RTC_SYNCH_PREDIV;
  RtcHandle.Init.OutPut         = RTC_OUTPUT_DISABLE;
  RtcHandle.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
  RtcHandle.Init.OutPutType     = RTC_OUTPUT_TYPE_OPENDRAIN;
	#endif
	
	/*********SEND THE DATA TO GROUND AND SET THE FLAG********/
	#if 0
	
	/*要求所需的矫正*/
	tcp_connect_sever("101.207.17.199","1113");
	uint8_t Test_senddata[11]={'H' ,'E' , 'L' , 'L' , 'O',  'I',  'T',  'I',  'S' , 'M' , 'E' , '!'};
	uint8_t Test_receivedata_example[11]={'!' ,'E'  , 'M'  ,'S' , 'I' , 'T' , 'I' , 'O'  ,'L'  ,'L' , 'E' , 'H' };
	uint8_t Test_receivedata[11]=(0);
	#endif
	
