WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.0.0/Src/main.c
	//HAL_ADC_Start_DMA(&hadc1, (uint32_t*)&ADC_Value, 100); //send ADC_data to ADC_value
	     
	printf("\r\n\r\n\r\n");
     
  /*启动GPS接收*/
	EC20_uart4_send((uint8_t*)UART4_Tx_GPS_TEST1);    // 发送AT+QGPS=1
	HAL_Delay(500);
	/*打印AT错误信息*/
	EC20_uart4_send((uint8_t*)UART4_Tx_TEST7);

	/*开启IDLE中断*/
	__HAL_UART_ENABLE_IT(&huart4, UART_IT_IDLE);
	/*启动DMA接收*/
//  HAL_UART_Receive_DMA(&huart4,ReceiveBuff,BUFFERSIZE); 

	
	
	
	bmp_data.v_actual_press_float = BMP280_ReadPressure();    //读取初始气压高度
		altitude1 = (1013.25-(bmp_data.v_actual_press_float/100))*9;
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
		HAL_GPIO_TogglePin(GPIOB,GPIO_PIN_2);

#if 1
#if 0
		//MP9250
		printf("-------------------------------\r\n");
		printf("MPU-9520 \r\n");
		READ_MPU9250_MAG();    //读取磁力计
		READ_MPU9250_ACCEL();  //读取加速度
		READ_MPU9250_GYRO();   //读取陀螺仪

		printf("Mag: x:%d \ty:%d\tz:%d    \r\n", mpu_value.Mag[0],mpu_value.Mag[1],mpu_value.Mag[2]);        //磁力计
		printf("Gyro: x:%d \ty:%d\tz:%d   \r\n", mpu_value.Gyro[0],mpu_value.Gyro[1],mpu_value.Gyro[2]);     // 陀螺仪
		printf("Accel: x:%d \ty:%d\tz:%d  \r\n", mpu_value.Accel[0],mpu_value.Accel[1],mpu_value.Accel[2]);   //加速度
		printf("-------------------------------\r\n\r\n\r\n");
		
//		MPU_Get_Gyro(&igx,&igy,&igz,&gx,&gy,&gz);
//		MPU_Get_Accel(&iax,&iay,&iaz,&ax,&ay,&az);
//		MPU_Get_Mag(&imx,&imy,&imz,&mx,&my,&mz);
		
		gx=(float)(mpu_value.Gyro[0])*gryo_scale;
	  gy=(float)(mpu_value.Gyro[1])*gryo_scale;
	  gz=(float)(mpu_value.Gyro[2])*gryo_scale;
		
  	ax=((float)(mpu_value.Accel[0])*accel_scale-accoffsetx)*accsensx;
   	ay=((float)(mpu_value.Accel[1])*accel_scale-accoffsety)*accsensy;
  	az=((float)(mpu_value.Accel[2])*accel_scale-accoffsetz)*accsensz;
   
		mx=B[0]*((float)(mpu_value.Mag[0])*mag_scale-magoffsetx)+B[1]*((float)(mpu_value.Mag[1])*mag_scale-magoffsety)+B[2]*((float)(mpu_value.Mag[2])*mag_scale-magoffsetz);
		my=B[1]*((float)(mpu_value.Mag[0])*mag_scale-magoffsetx)+B[3]*((float)(mpu_value.Mag[1])*mag_scale-magoffsety)+B[4]*((float)(mpu_value.Mag[2])*mag_scale-magoffsetz);
		mz=B[2]*((float)(mpu_value.Mag[0])*mag_scale-magoffsetx)+B[4]*((float)(mpu_value.Mag[1])*mag_scale-magoffsety)+B[5]*((float)(mpu_value.Mag[2])*mag_scale-magoffsetz);
	 
	 AHRSupdate(gx,gy,gz,ax,ay,az,mx,my,mz,&roll,&pitch,&yaw);
		printf("roll:   %f \r\n", roll  );        //磁力计
		printf("pitch:  %f \r\n", pitch );     // 陀螺仪
		printf("yaw:    %f  \r\n",  yaw);   //加速度
		printf("-------------------------------\r\n\r\n\r\n");
		
		#endif 
		//Bmp280
		bmp_data.v_actual_temp_float = BMP280_ReadTemperature();
		bmp_data.actual_press_u64 = BMP280_ReadPressure_int64();
		bmp_data.v_actual_press_float = BMP280_ReadPressure();

		printf("-------------------------------\r\n");
	
		printf("BMP280 \r\n");
		printf("  T32: %u ℃  \r\n", bmp_data.v_actual_temp_s32);   //直接读的温度值32位
		printf("  P32: %u Pa  \r\n", bmp_data.v_actual_press_u32);   //直接读的气压值32位
		printf("  P64: %.3f KPa \r\n", ((float)bmp_data.actual_press_u64 / 256.0f)/1000);   //将气压转换为64位
   	printf("  Tf: %.3f ℃\r\n", bmp_data.v_actual_temp_float);    //将温度转换为浮点型
		printf("  Pf: %.3f KPa  \r\n", bmp_data.v_actual_press_float/1000);   //将气压转换为浮点型

		float altitude2,altitude ,seaLevelhPa, mmHg;
		mmHg = bmp_data.v_actual_press_float / 133.321995f;   // 同为压强
		printf("  %.2f mmHg \r\n", mmHg);         

		seaLevelhPa = 101325.0f;     //标准大气压
	  altitude2 = (1013.25-((bmp_data.v_actual_press_float)/100))*9;   //测试点海拔高度
	  altitude = altitude2-altitude1;     //相对高度
	  //altitude = 44330 * (1.0 - pow((double)(bmp_data.v_actual_press_float / seaLevelhPa), 0.19029)); //pow函数？
		printf( "  %.2f m  \r\n", altitude);   //高度
   

		printf("  nerror: %u \r\n", bmp_data.err_cnt);
  	printf("-------------------------------\r\n\r\n");  
		
#endif
#if 0

	  printf("---------------------\r\n");
		printf("数据转换为字符串并发送\r\n");
		
		sprintf((char*)Atempdata1,"Mag: x:%d \ty:%d\tz:%d   \r\n", mpu_value.Mag[0],mpu_value.Mag[1],mpu_value.Mag[2]);
		sprintf((char*)Atempdata2,"Gyro: x:%d \ty:%d\tz:%d  \r\n", mpu_value.Gyro[0],mpu_value.Gyro[1],mpu_value.Gyro[2]);
		sprintf((char*)Atempdata3,"Accel: x:%d \ty:%d\tz:%d  \r\n", mpu_value.Accel[0],mpu_value.Accel[1],mpu_value.Accel[2]);
		
		
		sprintf((char*)tempdata1,"T32: %u 'C  \r\n", bmp_data.v_actual_temp_s32);
		sprintf((char*)tempdata2,"P32: %u Pa  \r\n", bmp_data.v_actual_press_u32);
		sprintf((char*)tempdata3,"P64: %.3f Pa \r\n", (float)bmp_data.actual_press_u64 / 256.0f);
		sprintf((char*)tempdata4,"Tf: %.3f  'C \r\n", bmp_data.v_actual_temp_float);
		sprintf((char*)tempdata5,"Pf: %.3f Pa  \r\n", bmp_data.v_actual_press_float);
		
		sprintf((char*)tempdata6,"%.2f mmHg \r\n", mmHg);
		sprintf((char*)tempdata7,"%.2f m  \r\n", altitude);

		//数据转换为字符串并发送
		EC20_Transmit_Printf((uint8_t*)Atempdata1);
		EC20_Transmit_Printf((uint8_t*)Atempdata2);
		EC20_Transmit_Printf((uint8_t*)Atempdata3);
		
		EC20_Transmit_Printf((uint8_t*)tempdata1);
		EC20_Transmit_Printf((uint8_t*)tempdata2);
		EC20_Transmit_Printf((uint8_t*)tempdata3);
		EC20_Transmit_Printf((uint8_t*)tempdata4);
		EC20_Transmit_Printf((uint8_t*)tempdata5);
		EC20_Transmit_Printf((uint8_t*)tempdata6);
		EC20_Transmit_Printf((uint8_t*)tempdata7);
		printf("END\r\n");
		printf("---------------------\r\n\r\n");
	#endif	

#if 0//GPRS test
	
		/*数据连接中断一次不可再连接，需重新启动或者关闭网络20秒左右后方能连接*/
		if(test_counter_polling==20)
		{
		  EC20_Transmit((uint8_t*)UART4_Tx_GPS_TEST1);
			test_counter_polling=0;
		}
		test_counter_polling++;
		


			
		#if 0
		/*询问GPS定位信息*/
		
		printf("444444\r\n");
		EC20_Transmit((uint8_t*)UART4_Tx_GPS_TEST2);
		
		/*接受串口数据*/		
	  EC20_Receive();
	 
		
		
		/*开启直传模式*/
		EC20_Transmit((uint8_t*)UART4_Tx_TCP_TEST1);
	  EC20_Receive();
		
    /*开启传送开关*/
		EC20_Transmit((uint8_t*)UART4_Tx_TCP_TEST2);
	  EC20_Receive();
		
		
		/*传送TCP数据*/
			printf("5555555\n");
		/*（1）传送GPS数据*/
	  EC20_Transmit((uint8_t*)GPS_DATA_RECEIVE);
		EC20_Transmit((uint8_t*)UART4_Tx_Flag_end);//结束标志0x1A
		EC20_Receive();
		
		/*（2）传送传感器数据*/
		
		/*传送BMP9250数据*/
		EC20_Transmit((uint8_t*)Atempdata1);
		EC20_Transmit((uint8_t*)Atempdata2);
		EC20_Transmit((uint8_t*)Atempdata3);
		
