WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.0.0/Src/main.c
		/*传送BMP280数据*/
		EC20_Transmit((uint8_t*)tempdata1);
		EC20_Transmit((uint8_t*)tempdata2);
		EC20_Transmit((uint8_t*)tempdata3);
		EC20_Transmit((uint8_t*)tempdata4);
		EC20_Transmit((uint8_t*)tempdata5);
		EC20_Transmit((uint8_t*)tempdata6);
		EC20_Transmit((uint8_t*)tempdata7);
		
		printf("666666\n");
		EC20_Transmit((uint8_t*)UART4_Tx_Flag_end);//结束标志0x1A
		EC20_Receive();
		
		
		/*打印并清除数据*/
		printf("\r\n数据如下：\r\n");
		 for(int i = 0; i < COUNTOF(GPS_DATA_RECEIVE); i++) 
    {
			printf("%c",ReceiveBuff[i]);
			GPS_DATA_RECEIVE[i]=0;
		}
		
		/*初始化检测*/
    test_flag=HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_15);
		
    /*如果检测STATE口为低，重新检测并初始化*/
		if(test_flag==1)
		{
			
      EC20_Init();
			test_count++;
			if(test_count==10)
			{
				printf("EC20断电失败\n");
				test_count=0;
				break;
			}
	  }
		#endif
#endif
				

#if 0 //adc采样，采样电池
				HAL_Delay(500);
        for(ADC_i = 0,ad1 =0; ADC_i< 100;)
        {
            ad1 += ADC_Value[ADC_i++];

        }
        ad1 /= 50;
        printf("\r\n******** ADC DMA Example ********\r\n\r\n");
        printf(" AD1 value = %1.3fV \r\n", ad1*3.3f/4096);


#endif


#if 0 //ec20数据整合
		
			/**********Send the data to the Ground and check it****************/
//			if(HAL_UART_Transmit_IT(&huart4, (uint8_t *)Test_senddata, sizeof(Test_senddata)) != HAL_OK)
//			{
//					Error_Handler();
//			}
//			Delay(100);
//		
//			if(HAL_UART_Receive_IT(&huart4, (uint8_t *)Test_receivedata, sizeof(Test_receivedata)) != HAL_OK)
//			{
//				Error_Handler();
//			}
//			
//		for(uint8_t comparecount=0,Different_flag=0;comparecount<=sizeof(Test_receivedata);comparecount++)//??辫?箨?????陏?Y
//		{	
//			/*****************COMPARE the flag of the data which form Ground*********************/
//			if(Test_receivedata[comparecount]==Test_receivedata_example[comparecount])
//			{
//				Different_flag++;
//				printf(" Connect %u  \n", Different_flag);
//			}
//			/***************If receive the data from Ground,begain send the data*************/
//			if(Different_flag==sizeof(Test_senddata))
//			{
//				Flag_run=SUCCFULL_STA;//enable the data of GPRS
//			}
//		}
	
		if(1)
		{
		tcp_connect_sever("101.207.17.199","1113");
		HAL_RTC_GetTime(&RtcHandle, &stimestructureget, RTC_FORMAT_BIN);//Get the time of RTC
		
		/***********Set the communication protocol on GPRS.***************/
		/*结构体赋值*/
		Uavcomunication.Longitude=mpu_value.Mag[0];
		Uavcomunication.Lantitude=mpu_value.Mag[1];
		Uavcomunication.Altitude=altitude;
		Uavcomunication.Speed_x=mpu_value.Accel[0];
		Uavcomunication.Speed_y=mpu_value.Accel[1];
		Uavcomunication.Speed_z=mpu_value.Accel[2];
		Uavcomunication.Roll_angle=mpu_value.Gyro[0];
		Uavcomunication.Pitch_angle=mpu_value.Gyro[1];
		Uavcomunication.Yaw_angle=mpu_value.Gyro[2];
		Uavcomunication.Timestamp=stimestructureget.Seconds;
		Uavcomunication.Battery_status=0;
		Uavcomunication.Uav_type=0;
		Uavcomunication.Vendor="HW";
		Uavcomunication.System_status=0;
		
		/*********ACCORDING TO STATE INIT THE Uavcomunication.System_status*************/
		if(bmp_data.err_cnt==0)
		{Uavcomunication.System_status=Uavcomunication.System_status&SENSORS_STATE_OK;}
		
		if(Flag_run==1)
		{Uavcomunication.System_status=Uavcomunication.System_status&CONNECT_STATE_OK;}
		
		/* To transmit the Uav of date */
		/*传送数据*/
		EC20_Transmit((uint8_t*)Uavcomunication);
		/*开启直传模式*/
		EC20_Transmit((uint8_t*)UART4_Tx_TCP_TEST1);
	  EC20_Receive();
		
    /*开启传送开关*/
		EC20_Transmit((uint8_t*)UART4_Tx_TCP_TEST2);
	  EC20_Receive();
		
		
		/*传送TCP数据*/
		
		/*传送UAV数据*/
	  EC20_Transmit((uint8_t*)Uavcomunication);
		EC20_Transmit((uint8_t*)UART4_Tx_Flag_end);//结束标志0x1A
		EC20_Receive();
		}
		
#if 0//message test
		
		/*设置短信存储区*/
		EC20_Transmit((uint8_t*)UART4_Tx_MESSAGE1);
	  EC20_Receive();

		/*设置短信存储区格式*/
		EC20_Transmit((uint8_t*)UART4_Tx_MESSAGE2);
		EC20_Receive();
			
		/*查询短信中心*/
		EC20_Transmit((uint8_t*)UART4_Tx_MESSAGE3);
	  EC20_Receive();

		/*设置短信文本格式*/
		EC20_Transmit((uint8_t*)UART4_Tx_MESSAGE4);
		EC20_Receive();
		
		/*发送短信，手机号码确定，结束标志位0X1A*/
		EC20_Transmit((uint8_t*)UART4_Tx_TEST6);
		EC20_Receive();
		
		/*发送字符串内容，字符串内容自定义*/
		EC20_Transmit((uint8_t*)GPS_DATA_RECEIVE);
	
    /*发送结束符，结束后需等待5秒收到短信*/
		EC20_Transmit((uint8_t*)UART4_Tx_Flag_end);
	
#endif
#endif
  HAL_Delay(3000);
  }
	
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 12;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC|RCC_PERIPHCLK_USART1
                              |RCC_PERIPHCLK_USART2|RCC_PERIPHCLK_USART3
                              |RCC_PERIPHCLK_UART4|RCC_PERIPHCLK_USB
                              |RCC_PERIPHCLK_ADC;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
  PeriphClkInit.Usart2ClockSelection = RCC_USART2CLKSOURCE_PCLK1;
  PeriphClkInit.Usart3ClockSelection = RCC_USART3CLKSOURCE_PCLK1;
  PeriphClkInit.Uart4ClockSelection = RCC_UART4CLKSOURCE_PCLK1;
  PeriphClkInit.AdcClockSelection = RCC_ADCCLKSOURCE_SYSCLK;
  PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
  PeriphClkInit.UsbClockSelection = RCC_USBCLKSOURCE_PLL;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the main internal regulator output voltage 
    */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/**
  * @brief NVIC Configuration.
  * @retval None
  */
static void MX_NVIC_Init(void)
{
  /* UART4_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(UART4_IRQn, 8, 0);
  HAL_NVIC_EnableIRQ(UART4_IRQn);
  /* USART3_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(USART3_IRQn, 11, 0);
  HAL_NVIC_EnableIRQ(USART3_IRQn);
  /* DMA2_Channel5_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Channel5_IRQn, 4, 0);
  HAL_NVIC_EnableIRQ(DMA2_Channel5_IRQn);
}

/* ADC1 init function */
static void MX_ADC1_Init(void)
{

